> Some resources may force a re-create if resource names are changed.
> 
> Can you do a full run with the latest module, then upgrade to this version and provide the output of what changes so we can see how this will impact current users.

Upgrading from `0.1.0` to this PR doesn't trigger any changes in other modules than DSPM, but these don't seem to be related to my changes: 
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fcs_account_primary.module.dspm_environments[0].aws_iam_role_policy.vpc_policy must be replaced
-/+ resource "aws_iam_role_policy" "vpc_policy" {
      ~ id          = "CrowdStrikeDSPMIntegrationRole:RunDataScanner-us-east-1-vpc-0fff2e4c2d5f9d099" -> (known after apply)
      ~ name        = "RunDataScanner-us-east-1-vpc-0fff2e4c2d5f9d099" -> "dspm-environment-RunDataScanner-us-east-1-vpc-0fff2e4c2d5f9d099" # forces replacement
      + name_prefix = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.fcs_account_primary.module.dspm_environments[0].aws_security_group.db_security_group must be replaced
-/+ resource "aws_security_group" "db_security_group" {
      ~ arn                    = "arn:aws:ec2:us-east-1:945129404747:security-group/sg-0e8c8691ec92a07c8" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0e8c8691ec92a07c8" -> (known after apply)
      ~ name                   = "DBSecurityGroup" -> "dspm-environment-DBSecurityGroup" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "945129404747" -> (known after apply)
        tags                   = {
            "CrowdStrikeLogicalId" = "DBSecurityGroup"
            "Name"                 = "dspm-environment-DB"
            "ProvisionedBy"        = "CrowdStrike"
        }
        # (4 unchanged attributes hidden)
    }

  # module.fcs_account_primary.module.dspm_environments[0].aws_security_group.ec2_security_group must be replaced
-/+ resource "aws_security_group" "ec2_security_group" {
      ~ arn                    = "arn:aws:ec2:us-east-1:945129404747:security-group/sg-0022d2f24408d545c" -> (known after apply)
      ~ id                     = "sg-0022d2f24408d545c" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "EC2SecurityGroup" -> "dspm-environment-EC2SecurityGroup" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "945129404747" -> (known after apply)
        tags                   = {
            "CrowdStrikeLogicalId" = "EC2SecurityGroup"
            "Name"                 = "dspm-environment-EC2"
            "ProvisionedBy"        = "CrowdStrike"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
```

that is without adding prefix/suffix or tags, just using the same `terraform.tfvars` file and upgrading 0.1.0 -> this PR